work/Univ/2026_05_19_New_sphere/result/chenge_U/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
simulationType laminar;
