work/Univ/2026_05_19_New_sphere/result/chenge_U/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
numberOfSubdomains 2;
method scotch;
