work/Univ/2026_05_19_New_sphere/result/chenge_U/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
surfaces
(
    "Assembly.stl"
    "Cuboid.stl"
);
includedAngle 165.0;
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
writeObj yes;
